## Plan for org_account/iam_identity_center
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**🧹 &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
digital_transformation_office_permissions.tf
```
```terraform
Plan: 3 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                     NAME                                                     |
|--------|--------------------------------------------------------------------------------------------------------------|
| add    | `aws_ssoadmin_account_assignment.cra_dashboard_staging[&quot;CRADashboard-Staging-ReadOnly-CRABucket-GetObject&quot;]` |
|        | `aws_ssoadmin_permission_set.cra_bucket_get_object`                                                          |
|        | `aws_ssoadmin_permission_set_inline_policy.cra_bucket_get_object`                                            |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ssoadmin_account_assignment.cra_dashboard_staging["CRADashboard-Staging-ReadOnly-CRABucket-GetObject"] will be created
  + resource "aws_ssoadmin_account_assignment" "cra_dashboard_staging" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = (known after apply)
      + principal_id       = "ac2d5518-b011-70ad-bc07-eb1fb895b1d5"
      + principal_type     = "GROUP"
      + target_id          = "211125499457"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_permission_set.cra_bucket_get_object will be created
  + resource "aws_ssoadmin_permission_set" "cra_bucket_get_object" {
      + arn              = (known after apply)
      + created_date     = (known after apply)
      + description      = "Grants read-only access to the CRA S3 bucket."
      + id               = (known after apply)
      + instance_arn     = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + name             = "CRABucket-GetObject"
      + session_duration = "PT1H"
      + tags_all         = (known after apply)
    }

  # aws_ssoadmin_permission_set_inline_policy.cra_bucket_get_object will be created
  + resource "aws_ssoadmin_permission_set_inline_policy" "cra_bucket_get_object" {
      + id                 = (known after apply)
      + inline_policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                          + "s3:GetObjectAcl",
                          + "s3:GetObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::cra-upd-dashboard-data-staging/*",
                          + "arn:aws:s3:::cra-upd-dashboard-data-staging",
                        ]
                      + Sid      = "AllowDataBucketReadAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.admin_pinpoint_sms"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.admin_route53_notify_hosted_zone"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.admin_s3_website_assets"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.admin_support_center"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.athena_query_access"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.canadian_digital_service_production_website_admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.cra_bucket_get_object"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.notify_access_ecs_blazer"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.quicksight"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.rds_query_access"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.read_only_billing"]

30 tests, 19 passed, 11 warnings, 0 failures, 0 exceptions

```

</details>
